mymy49/CrossworksForARM_Nuvoton_M251/targets/M25x/Loader/M25x_AP_64/loader.c
/*****************************************************************************
 * Copyright (c) 2023 Rowley Associates Limited.                             *
 *                                                                           *
 * This file may be distributed under the terms of the License Agreement     *
 * provided with this software.                                              *
 *                                                                           *
 * THIS FILE IS PROVIDED AS IS WITH NO WARRANTY OF ANY KIND, INCLUDING THE   *
 * WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. *
 *                                                                           *
 *****************************************************************************/

#include <libmem.h>
#include <libmem_loader.h>
#include "libmem_m2xx.h"
#include "NuMicro.h"

extern uint8_t __RAM_segment_start__;
extern uint8_t __RAM_segment_used_end__;
extern uint8_t __RAM_segment_end__;

int Init(unsigned long adr, unsigned long clk, unsigned long fnc);

int EraseSector(unsigned long adr);

int ProgramPage(unsigned long adr, unsigned long sz, unsigned char *buf);

int main(uint32_t flags, uint32_t param)
{
  int res;
  uint32_t fosc = flags & LIBMEM_RPC_LOADER_FLAG_PARAM ? param : 0;
  const char *error_string = 0;
  libmem_driver_handle_t flash1_handle;

#if 1
	uint8_t data[512];

	for(uint32_t i = 0; i < 512; i++)
		data[i] = i;

	Init(0, 0, 0);

	EraseSector(0);

	ProgramPage(0, 512, data);

#endif

  /* Configure target if loader is not required to preserve target state */
  if ((flags & LIBMEM_RPC_LOADER_FLAG_PRESERVE_STATE) == 0)
    SystemInit();

  /* Register M43x internal FLASH driver */
  res = libmem_m2xx_register_internal_flash_driver(&flash1_handle, fosc);
	
  /* Start loader */
  if (res == LIBMEM_STATUS_SUCCESS)
    res = libmem_rpc_loader_start(&__RAM_segment_used_end__, &__RAM_segment_end__ - 1);

  /* Terminate loader */
  libmem_rpc_loader_exit(res, error_string);

  return 0;
}
